import React from 'react';

function PrivacyPolicy() {
  return (
    <div style={{ padding: '20px', maxWidth: '800px', margin: 'auto' }}>
      <h1>سياسة الخصوصية لتطبيق الحسام </h1>
      

      <h3>المعلومات التي نجمعها</h3>
      <p>
        نحن في تطبيق "الحسام" نأخذ خصوصيتك على محمل الجد. توضح سياسة الخصوصية هذه كيف نقوم بجمع واستخدام وحماية المعلومات التي يتم جمعها من خلال تطبيقنا.
      </p>
      <ul>
        <li><strong>المعلومات الشخصية:</strong> عند تسجيل الدخول باستخدام حساب Google، نقوم بجمع المعلومات التي يتم تقديمها من خلال خدمة Google OAuth، مثل اسم المستخدم والبريد الإلكتروني.</li>
        <li><strong>الملفات والبيانات:</strong> عند استخدامك لتطبيقنا لتحميل ملفات إلى Google Drive، نقوم بمعالجة الملفات التي تختار رفعها فقط. لا نقوم بجمع أو الوصول إلى أي ملفات أخرى في حسابك.</li>
      </ul>

      <h3>كيفية استخدام المعلومات</h3>
      <p>
        نستخدم المعلومات التي نجمعها لأغراض محددة:
      </p>
      <ul>
        <li><strong>تسجيل الدخول:</strong> لتسجيل الدخول باستخدام حساب Google وتوفير الوصول إلى Google Drive.</li>
        <li><strong>رفع الملفات:</strong> لتمكين المستخدمين من رفع الملفات إلى حساباتهم على Google Drive باستخدام التطبيق.</li>
        <li><strong>تحسين الخدمة:</strong> لفهم كيفية استخدام المستخدمين للتطبيق وتحسين تجربتهم.</li>
      </ul>

      <h3>كيفية حماية المعلومات</h3>
      <p>
        نلتزم بحماية المعلومات الشخصية للمستخدمين. نستخدم تقنيات الأمان المناسبة لحماية المعلومات التي يتم إرسالها عبر الإنترنت. ومع ذلك، لا يمكننا ضمان الأمان الكامل للبيانات بسبب المخاطر الطبيعية في الشبكة.
      </p>

      <h3>مشاركة المعلومات مع أطراف ثالثة</h3>
      <p>
        نحن لا نشارك معلومات المستخدمين مع أطراف ثالثة ما لم يكن ذلك ضروريًا لتوفير الخدمة (مثل Google OAuth وخدمات Google Drive) أو كما يقتضي القانون.
      </p>

      <h3>الأذونات المطلوبة</h3>
      <ul>
        <li><strong>Google OAuth:</strong> نحن نطلب منك السماح لنا بالوصول إلى بعض المعلومات الأساسية من حساب Google الخاص بك (مثل الاسم والبريد الإلكتروني).</li>
        <li><strong>Google Drive:</strong> نطلب إذنًا للوصول إلى Google Drive الخاص بك لتمكينك من رفع الملفات.</li>
      </ul>

      <h3>حقوق المستخدمين</h3>
      <p>
        - يمكنك <strong>إلغاء الوصول</strong> إلى حساب Google الخاص بك من خلال إعدادات حسابك في Google.<br />
        - يمكنك <strong>حذف الحساب</strong> أو <strong>حذف الملفات</strong> من التطبيق في أي وقت.
      </p>

      <h3>التعديلات على سياسة الخصوصية</h3>
      <p>
       قد نقوم بتحديث هذه السياسة من حين لآخر. في حال تم إجراء تغييرات جوهرية، سنقوم بنشر إشعار على هذه الصفحة .
      </p>

      <h3> </h3>
      <p>
        إذا كان لديك أي استفسارات حول سياسة الخصوصية هذه أو كنت بحاجة إلى المزيد من المعلومات، يمكنك الاتصال بنا على:<br />
        <strong> +9647844440707 </strong> 
      </p>

      <h3> او عن طريق البريد الالكتروني </h3>
      <strong> ameerameen888@gmail.com </strong>
    </div>
  );
};

export default PrivacyPolicy;